wilhel1812/esp32-c6-zigbee-base/components/esp32_c6_zigbee_base/esp32_c6_zigbee_base.c
#include "esp32_c6_zigbee_base.h"

#include <stdbool.h>
#include <stdint.h>
#include <string.h>

#include "board_input.h"
#include "esp_check.h"
#include "esp_log.h"
#include "esp_timer.h"
#include "esp_system.h"
#include "nvs.h"
#include "nvs_flash.h"

#include "freertos/FreeRTOS.h"
#include "freertos/task.h"

#include "ezbee/nwk.h"
#include "ezbee/zha.h"
#include "ezbee/zcl/cluster/basic.h"
#include "ezbee/zcl/cluster/identify.h"
#include "ezbee/zcl/cluster/level_desc.h"
#include "ezbee/zcl/zcl_general_cmd.h"

#include "status_display.h"
#include "status_led.h"

#define ZCL_STRING_MAX_LEN 32

static const char *TAG = "ZB_BASE";

static esp32_c6_zigbee_base_config_t s_config;
static bool s_joined;
static bool s_output_on;
static bool s_display_light_on = true;
static uint8_t s_display_light_level = 0xff;
static bool s_status_led_light_on = true;
static uint8_t s_status_led_light_level = 0xff;
static uint32_t s_identify_generation;
static int64_t s_identify_end_us;
static uint8_t s_manufacturer_zcl[ZCL_STRING_MAX_LEN + 1];
static uint8_t s_model_zcl[ZCL_STRING_MAX_LEN + 1];
static uint8_t s_date_code_zcl[ZCL_STRING_MAX_LEN + 1];
static uint8_t s_sw_build_zcl[ZCL_STRING_MAX_LEN + 1];

static void zcl_string_set(uint8_t *dest, const char *value)
{
    size_t len = value ? strnlen(value, ZCL_STRING_MAX_LEN) : 0;
    dest[0] = len;
    if (len > 0) {
        memcpy(&dest[1], value, len);
    }
}

static void copy_config(const esp32_c6_zigbee_base_config_t *config)
{
    esp32_c6_zigbee_base_config_t defaults = ESP32_C6_ZIGBEE_BASE_DEFAULT_CONFIG();
    s_config = config ? *config : defaults;

    if (!s_config.manufacturer_name) {
        s_config.manufacturer_name = defaults.manufacturer_name;
    }
    if (!s_config.model_identifier) {
        s_config.model_identifier = defaults.model_identifier;
    }
    if (!s_config.date_code) {
        s_config.date_code = defaults.date_code;
    }
    if (!s_config.sw_build_id) {
        s_config.sw_build_id = defaults.sw_build_id;
    }
    if (!s_config.storage_partition_name) {
        s_config.storage_partition_name = defaults.storage_partition_name;
    }
    if (!s_config.app_nvs_namespace) {
        s_config.app_nvs_namespace = defaults.app_nvs_namespace;
    }
    if (s_config.primary_channel_mask == 0) {
        s_config.primary_channel_mask = defaults.primary_channel_mask;
    }
    if (s_config.factory_reset_hold_ms == 0) {
        s_config.factory_reset_hold_ms = defaults.factory_reset_hold_ms;
    }

    zcl_string_set(s_manufacturer_zcl, s_config.manufacturer_name);
    zcl_string_set(s_model_zcl, s_config.model_identifier);
    zcl_string_set(s_date_code_zcl, s_config.date_code);
    zcl_string_set(s_sw_build_zcl, s_config.sw_build_id);
}

static void update_visual_state(status_led_mode_t led_mode, status_display_state_t display_state)
{
    status_led_set_mode(led_mode);
    status_display_set_state(display_state);
}

static void set_joined_visual_state(void)
{
    status_led_set_joined(s_output_on);
    status_display_set_state(s_output_on ? STATUS_DISPLAY_JOINED_ON : STATUS_DISPLAY_JOINED_OFF);
}

static esp_err_t load_u8_key(nvs_handle_t handle, const char *key, uint8_t *value)
{
    esp_err_t err = nvs_get_u8(handle, key, value);
    return err == ESP_ERR_NVS_NOT_FOUND ? ESP_OK : err;
}

static esp_err_t load_app_state(void)
{
    nvs_handle_t handle;
    uint8_t on = 0;
    uint8_t level = 0;
    esp_err_t ret = nvs_open(s_config.app_nvs_namespace, NVS_READONLY, &handle);
    if (ret == ESP_ERR_NVS_NOT_FOUND) {
        s_output_on = false;
        return ESP_OK;
    }
    ESP_RETURN_ON_ERROR(ret, TAG, "failed to open app NVS");

    ret = load_u8_key(handle, "onoff", &on);
    ESP_GOTO_ON_ERROR(ret, done, TAG, "failed to read output state");
    s_output_on = on != 0;

    on = s_display_light_on ? 1 : 0;
    level = s_display_light_level;
    ESP_GOTO_ON_ERROR(load_u8_key(handle, "disp_on", &on), done, TAG, "failed to read display on state");
    ESP_GOTO_ON_ERROR(load_u8_key(handle, "disp_level", &level), done, TAG, "failed to read display level");
    s_display_light_on = on != 0;
    s_display_light_level = level;

    on = s_status_led_light_on ? 1 : 0;
    level = s_status_led_light_level;
    ESP_GOTO_ON_ERROR(load_u8_key(handle, "led_on", &on), done, TAG, "failed to read LED on state");
    ESP_GOTO_ON_ERROR(load_u8_key(handle, "led_level", &level), done, TAG, "failed to read LED level");
    s_status_led_light_on = on != 0;
    s_status_led_light_level = level;

done:
    nvs_close(handle);
    return ret;
}

static esp_err_t save_app_state(void)
{
    nvs_handle_t handle;
    ESP_RETURN_ON_ERROR(nvs_open(s_config.app_nvs_namespace, NVS_READWRITE, &handle), TAG, "failed to open app NVS");
    esp_err_t err = nvs_set_u8(handle, "onoff", s_output_on ? 1 : 0);
    if (err == ESP_OK) {
        err = nvs_set_u8(handle, "disp_on", s_display_light_on ? 1 : 0);
    }
    if (err == ESP_OK) {
        err = nvs_set_u8(handle, "disp_level", s_display_light_level);
    }
    if (err == ESP_OK) {
        err = nvs_set_u8(handle, "led_on", s_status_led_light_on ? 1 : 0);
    }
    if (err == ESP_OK) {
        err = nvs_set_u8(handle, "led_level", s_status_led_light_level);
    }
    if (err == ESP_OK) {
        err = nvs_commit(handle);
    }
    nvs_close(handle);
    return err;
}

static void apply_user_lights(void)
{
    ESP_LOGI(TAG, "Display backlight on=%u level=%u", s_display_light_on, s_display_light_level);
    status_display_set_backlight(s_display_light_on ? s_display_light_level : 0);
    status_led_set_user_light(s_status_led_light_on, s_status_led_light_level);
}

static void report_onoff_state(void)
{
    ezb_zcl_report_attr_cmd_t report = {
        .cmd_ctrl = {
            .dst_addr = EZB_ADDRESS_SHORT(0x0000),
            .dst_ep = 1,
            .src_ep = s_config.onoff_endpoint_id,
            .cluster_id = EZB_ZCL_CLUSTER_ID_ON_OFF,
            .manuf_code = EZB_ZCL_STD_MANUF_CODE,
            .fc = {
                .direction = 1,
                .dis_default_rsp = 1,
            },
        },
        .payload = {
            .attr_id = EZB_ZCL_ATTR_ON_OFF_ON_OFF_ID,
        },
    };

    ezb_err_t err = ezb_zcl_report_attr_cmd_req(&report);
    if (err != EZB_ERR_NONE) {
        ESP_LOGD(TAG, "OnOff report request skipped/failed: 0x%04x", err);
    }
}

static void set_output_state(bool on, bool flash_command)
{
    s_output_on = on;
    ESP_ERROR_CHECK_WITHOUT_ABORT(save_app_state());

    if (flash_command) {
        status_led_flash_command(on);
    } else {
        status_led_set_joined(on);
    }
    status_display_set_state(on ? STATUS_DISPLAY_JOINED_ON : STATUS_DISPLAY_JOINED_OFF);
    report_onoff_state();
}

static void restore_zcl_onoff_attr(void)
{
    /*
     * The OnOff attribute is initialized from NVS before endpoint registration.
     * After the Zigbee stack is active, this SDK treats the descriptor as owned
     * by the stack and rejects direct descriptor writes.
     */
}

