wilhel1812/esp32-c6-zigbee-base/components/esp32_c6_zigbee_base/esp32_c6_zigbee_base.c
static void identify_timeout_task(void *arg)
{
    uint32_t generation = (uint32_t)(uintptr_t)arg;

    while (true) {
        vTaskDelay(pdMS_TO_TICKS(250));
        if (generation != s_identify_generation) {
            break;
        }
        if (esp_timer_get_time() >= s_identify_end_us) {
            if (s_joined) {
                set_joined_visual_state();
            } else {
                update_visual_state(STATUS_LED_MODE_JOINING, STATUS_DISPLAY_PAIRING);
            }
            break;
        }
    }

    vTaskDelete(NULL);
}

static void start_identify_visual(uint16_t identify_time_s)
{
    if (identify_time_s == 0) {
        s_identify_generation++;
        if (s_joined) {
            set_joined_visual_state();
        }
        return;
    }

    s_identify_generation++;
    s_identify_end_us = esp_timer_get_time() + (int64_t)identify_time_s * 1000000;
    update_visual_state(STATUS_LED_MODE_IDENTIFYING, STATUS_DISPLAY_IDENTIFYING);
    xTaskCreate(identify_timeout_task, "identify_timeout", 3072, (void *)(uintptr_t)s_identify_generation, 4, NULL);
}

static void zigbee_factory_reset_cb(void *ctx)
{
    update_visual_state(STATUS_LED_MODE_FACTORY_RESET, STATUS_DISPLAY_FACTORY_RESETTING);
    if (s_joined) {
        ezb_bdb_reset_via_local_action();
    } else {
        esp_zigbee_factory_reset();
    }
}

static void board_input_handler(board_input_event_t event, void *ctx)
{
    switch (event) {
    case BOARD_INPUT_EVENT_RESET_HOLD_START:
        update_visual_state(STATUS_LED_MODE_RESET_HOLD, STATUS_DISPLAY_RESET_HOLD);
        break;
    case BOARD_INPUT_EVENT_FACTORY_RESET_REQUEST:
        ESP_LOGW(TAG, "Local factory reset requested");
        update_visual_state(STATUS_LED_MODE_FACTORY_RESET, STATUS_DISPLAY_FACTORY_RESETTING);
        if (esp_zigbee_is_started()) {
            ESP_ERROR_CHECK_WITHOUT_ABORT(esp_zigbee_task_queue_post(zigbee_factory_reset_cb, NULL));
        }
        break;
    default:
        break;
    }
}

static void schedule_network_steering(void *arg)
{
    vTaskDelay(pdMS_TO_TICKS((uint32_t)(uintptr_t)arg));

    esp_zigbee_lock_acquire(portMAX_DELAY);
    (void)ezb_bdb_start_top_level_commissioning(EZB_BDB_MODE_NETWORK_STEERING);
    esp_zigbee_lock_release();

    vTaskDelete(NULL);
}

static void retry_network_steering(uint32_t delay_ms)
{
    xTaskCreate(schedule_network_steering, "zb_steer_retry", 3072, (void *)delay_ms, 5, NULL);
}

static bool zigbee_signal_handler(const ezb_app_signal_t *app_signal)
{
    ezb_app_signal_type_t signal_type = ezb_app_signal_get_type(app_signal);

    switch (signal_type) {
    case EZB_ZDO_SIGNAL_SKIP_STARTUP:
        ESP_LOGI(TAG, "Initialize Zigbee stack");
        ezb_bdb_start_top_level_commissioning(EZB_BDB_MODE_INITIALIZATION);
        break;

    case EZB_BDB_SIGNAL_DEVICE_FIRST_START:
    case EZB_BDB_SIGNAL_DEVICE_REBOOT: {
        ezb_bdb_comm_status_t status = *((ezb_bdb_comm_status_t *)ezb_app_signal_get_params(app_signal));
        if (status == EZB_BDB_STATUS_SUCCESS) {
            ESP_LOGI(TAG, "Device started in%s factory-reset mode", ezb_bdb_is_factory_new() ? "" : " non");
            if (ezb_bdb_is_factory_new()) {
                s_joined = false;
                update_visual_state(STATUS_LED_MODE_JOINING, STATUS_DISPLAY_PAIRING);
                ezb_bdb_start_top_level_commissioning(EZB_BDB_MODE_NETWORK_STEERING);
            } else {
                s_joined = true;
                restore_zcl_onoff_attr();
                set_joined_visual_state();
                ESP_LOGI(TAG, "Device rebooted on joined network");
            }
        } else {
            ESP_LOGW(TAG, "%s failed with status 0x%02x", ezb_app_signal_to_string(signal_type), status);
            status_led_error_blink();
            status_display_set_state(STATUS_DISPLAY_ERROR);
            retry_network_steering(1000);
        }
    } break;

    case EZB_BDB_SIGNAL_STEERING: {
        ezb_bdb_comm_status_t status = *((ezb_bdb_comm_status_t *)ezb_app_signal_get_params(app_signal));
        if (status == EZB_BDB_STATUS_SUCCESS) {
            ESP_LOGI(TAG, "Network steering completed: PAN 0x%04hx channel %u short 0x%04hx",
                     ezb_nwk_get_panid(), ezb_nwk_get_current_channel(), ezb_nwk_get_short_address());
            s_joined = true;
            restore_zcl_onoff_attr();
            set_joined_visual_state();
        } else {
            ESP_LOGW(TAG, "Network steering failed with status 0x%02x", status);
            s_joined = false;
            status_led_error_blink();
            status_display_set_state(STATUS_DISPLAY_ERROR);
            update_visual_state(STATUS_LED_MODE_JOINING, STATUS_DISPLAY_PAIRING);
            retry_network_steering(3000);
        }
    } break;

    case EZB_ZDO_SIGNAL_LEAVE: {
        ezb_zdo_signal_leave_params_t *params = (ezb_zdo_signal_leave_params_t *)ezb_app_signal_get_params(app_signal);
        ESP_LOGW(TAG, "Leave signal type %u", params ? params->leave_type : 0xff);
        s_joined = false;
        if (params && params->leave_type == EZB_ZDO_LEAVE_TYPE_REJOIN) {
            update_visual_state(STATUS_LED_MODE_REJOINING, STATUS_DISPLAY_REJOINING);
        } else {
            update_visual_state(STATUS_LED_MODE_JOINING, STATUS_DISPLAY_PAIRING);
            esp_restart();
        }
    } break;

    case EZB_NWK_SIGNAL_NO_ACTIVE_LINKS_LEFT:
    case EZB_NWK_SIGNAL_NETWORK_STATUS:
        ESP_LOGW(TAG, "Network health signal: %s", ezb_app_signal_to_string(signal_type));
        update_visual_state(STATUS_LED_MODE_REJOINING, STATUS_DISPLAY_REJOINING);
        break;

    case EZB_NWK_SIGNAL_PERMIT_JOIN_STATUS: {
        uint8_t duration = *(uint8_t *)ezb_app_signal_get_params(app_signal);
        ESP_LOGI(TAG, "Permit join is %s for network 0x%04hx", duration ? "open" : "closed", ezb_nwk_get_panid());
    } break;

    default:
        ESP_LOGI(TAG, "Zigbee signal: %s (0x%02x)", ezb_app_signal_to_string(signal_type), signal_type);
        break;
    }

