wilhel1812/esp32-c6-zigbee-base/components/esp32_c6_zigbee_base/esp32_c6_zigbee_base.c
    return true;
}

static void handle_set_attr_value(ezb_zcl_set_attr_value_message_t *message)
{
    ESP_RETURN_ON_FALSE(message, , TAG, "empty ZCL set-attribute message");

    ESP_LOGI(TAG, "Set attribute: ep=%d cluster=0x%04x role=%s status=0x%02x",
             message->info.dst_ep,
             message->info.cluster_id,
             message->info.cluster_role == EZB_ZCL_CLUSTER_SERVER ? "server" : "client",
             message->info.status);

    if (message->info.cluster_role != EZB_ZCL_CLUSTER_SERVER ||
        message->info.status != EZB_ZCL_STATUS_SUCCESS) {
        return;
    }

    if (message->info.dst_ep == s_config.onoff_endpoint_id &&
        message->info.cluster_id == EZB_ZCL_CLUSTER_ID_ON_OFF &&
        message->in.attribute.id == EZB_ZCL_ATTR_ON_OFF_ON_OFF_ID) {
        bool on = *(uint8_t *)message->in.attribute.data.value;
        ESP_LOGI(TAG, "Set OnOff to %d", on);
        set_output_state(on, true);
        return;
    }

    if ((message->info.dst_ep == s_config.display_light_endpoint_id ||
         message->info.dst_ep == s_config.status_led_endpoint_id) &&
        message->info.cluster_id == EZB_ZCL_CLUSTER_ID_ON_OFF &&
        message->in.attribute.id == EZB_ZCL_ATTR_ON_OFF_ON_OFF_ID) {
        bool on = *(uint8_t *)message->in.attribute.data.value;
        if (message->info.dst_ep == s_config.display_light_endpoint_id) {
            s_display_light_on = on;
        } else {
            s_status_led_light_on = on;
        }
        apply_user_lights();
        ESP_ERROR_CHECK_WITHOUT_ABORT(save_app_state());
        return;
    }

    if ((message->info.dst_ep == s_config.display_light_endpoint_id ||
         message->info.dst_ep == s_config.status_led_endpoint_id) &&
        message->info.cluster_id == EZB_ZCL_CLUSTER_ID_LEVEL &&
        message->in.attribute.id == EZB_ZCL_ATTR_LEVEL_CURRENT_LEVEL_ID) {
        uint8_t level = *(uint8_t *)message->in.attribute.data.value;
        if (message->info.dst_ep == s_config.display_light_endpoint_id) {
            s_display_light_level = level;
        } else {
            s_status_led_light_level = level;
        }
        apply_user_lights();
        ESP_ERROR_CHECK_WITHOUT_ABORT(save_app_state());
        return;
    }

    if (message->info.cluster_id == EZB_ZCL_CLUSTER_ID_IDENTIFY &&
        message->in.attribute.id == EZB_ZCL_ATTR_IDENTIFY_IDENTIFY_TIME_ID) {
        uint16_t identify_time = *(uint16_t *)message->in.attribute.data.value;
        ESP_LOGI(TAG, "IdentifyTime set to %u seconds", identify_time);
        start_identify_visual(identify_time);
        return;
    }
}

static void handle_identify_effect(ezb_zcl_identify_effect_message_t *message)
{
    ESP_RETURN_ON_FALSE(message, , TAG, "empty identify effect message");
    if (message->info.status != EZB_ZCL_STATUS_SUCCESS) {
        return;
    }

    ESP_LOGI(TAG, "Identify effect id=%u variant=%u", message->in.effect_id, message->in.effect_variant);
    message->out.result = EZB_ZCL_STATUS_SUCCESS;
    start_identify_visual(5);
}

static void handle_basic_factory_reset(ezb_zcl_basic_reset_factory_default_message_t *message)
{
    ESP_RETURN_ON_FALSE(message, , TAG, "empty Basic reset message");
    if (message->info.status != EZB_ZCL_STATUS_SUCCESS) {
        return;
    }

    ESP_LOGW(TAG, "Basic ResetToFactoryDefaults received");
    message->out.result = EZB_ZCL_STATUS_SUCCESS;
    zigbee_factory_reset_cb(NULL);
}

static esp_err_t basic_attr_add_or_set(ezb_zcl_cluster_desc_t basic_desc, uint16_t attr_id, const void *value)
{
    ezb_zcl_attr_desc_t attr = ezb_zcl_cluster_get_attr_desc(basic_desc, attr_id, EZB_ZCL_STD_MANUF_CODE);
    if (attr) {
        return esp_zigbee_err_to_esp(ezb_zcl_attr_desc_set_value(attr, value));
    }

    return esp_zigbee_err_to_esp(ezb_zcl_basic_cluster_desc_add_attr(basic_desc, attr_id, value));
}

static esp_err_t populate_basic_attrs(ezb_af_ep_desc_t ep_desc)
{
    ezb_zcl_cluster_desc_t basic_desc = ezb_af_endpoint_get_cluster_desc(ep_desc, EZB_ZCL_CLUSTER_ID_BASIC, EZB_ZCL_CLUSTER_SERVER);
    static uint8_t power_source = EZB_ZCL_BASIC_POWER_SOURCE_DC_SOURCE;
    static uint8_t device_enabled = 1;
    static uint8_t generic_device_type = EZB_ZCL_BASIC_GENERIC_DEVICE_TYPE_GATEWAY_OR_BRIDGE;

    ESP_RETURN_ON_FALSE(basic_desc, ESP_ERR_NOT_FOUND, TAG, "basic cluster missing");
    ESP_RETURN_ON_ERROR(basic_attr_add_or_set(basic_desc, EZB_ZCL_ATTR_BASIC_MANUFACTURER_NAME_ID,
                                              s_manufacturer_zcl), TAG, "manufacturer attr failed");
    ESP_RETURN_ON_ERROR(basic_attr_add_or_set(basic_desc, EZB_ZCL_ATTR_BASIC_MODEL_IDENTIFIER_ID,
                                              s_model_zcl), TAG, "model attr failed");
    ESP_RETURN_ON_ERROR(basic_attr_add_or_set(basic_desc, EZB_ZCL_ATTR_BASIC_APPLICATION_VERSION_ID,
                                              &s_config.application_version), TAG, "application version attr failed");
    ESP_RETURN_ON_ERROR(basic_attr_add_or_set(basic_desc, EZB_ZCL_ATTR_BASIC_HW_VERSION_ID,
                                              &s_config.hardware_version), TAG, "hardware version attr failed");
    ESP_RETURN_ON_ERROR(basic_attr_add_or_set(basic_desc, EZB_ZCL_ATTR_BASIC_DATE_CODE_ID,
                                              s_date_code_zcl), TAG, "date code attr failed");
    ESP_RETURN_ON_ERROR(basic_attr_add_or_set(basic_desc, EZB_ZCL_ATTR_BASIC_POWER_SOURCE_ID, &power_source),
                        TAG, "power source attr failed");
    ESP_RETURN_ON_ERROR(basic_attr_add_or_set(basic_desc, EZB_ZCL_ATTR_BASIC_GENERIC_DEVICE_TYPE_ID, &generic_device_type),
                        TAG, "generic device type attr failed");
    ESP_RETURN_ON_ERROR(basic_attr_add_or_set(basic_desc, EZB_ZCL_ATTR_BASIC_DEVICE_ENABLED_ID, &device_enabled),
                        TAG, "device enabled attr failed");
    ESP_RETURN_ON_ERROR(basic_attr_add_or_set(basic_desc, EZB_ZCL_ATTR_BASIC_SW_BUILD_ID_ID,
                                              s_sw_build_zcl), TAG, "software build attr failed");

    return ESP_OK;
}

static esp_err_t set_cluster_attr(ezb_af_ep_desc_t ep_desc, uint16_t cluster_id, uint16_t attr_id, const void *value)
{
    ezb_zcl_cluster_desc_t cluster = ezb_af_endpoint_get_cluster_desc(ep_desc, cluster_id, EZB_ZCL_CLUSTER_SERVER);
    ESP_RETURN_ON_FALSE(cluster, ESP_ERR_NOT_FOUND, TAG, "cluster 0x%04x missing", cluster_id);

