wilhel1812/esp32-c6-zigbee-base/components/esp32_c6_zigbee_base/esp32_c6_zigbee_base.c
    ezb_zcl_attr_desc_t attr = ezb_zcl_cluster_get_attr_desc(cluster, attr_id, EZB_ZCL_STD_MANUF_CODE);
    ESP_RETURN_ON_FALSE(attr, ESP_ERR_NOT_FOUND, TAG, "attribute 0x%04x missing", attr_id);
    return esp_zigbee_err_to_esp(ezb_zcl_attr_desc_set_value(attr, value));
}

static void zcl_action_handler(ezb_zcl_core_action_callback_id_t callback_id, void *message)
{
    switch (callback_id) {
    case EZB_ZCL_CORE_SET_ATTR_VALUE_CB_ID:
        handle_set_attr_value(message);
        break;

    case EZB_ZCL_CORE_IDENTIFY_EFFECT_CB_ID:
        handle_identify_effect(message);
        break;

    case EZB_ZCL_CORE_BASIC_RESET_TO_FACTORY_DEFAULT_CB_ID:
        handle_basic_factory_reset(message);
        break;

    case EZB_ZCL_CORE_CONFIG_REPORT_RSP_CB_ID:
        ESP_LOGI(TAG, "Configure reporting response received");
        break;

    case EZB_ZCL_CORE_DEFAULT_RSP_CB_ID: {
        ezb_zcl_cmd_default_rsp_message_t *default_rsp = (ezb_zcl_cmd_default_rsp_message_t *)message;
        ESP_LOGI(TAG, "Default response status 0x%02x", default_rsp->in.status_code);
    } break;

    default:
        if (s_config.zcl_action_cb && s_config.zcl_action_cb(callback_id, message, s_config.callback_ctx)) {
            break;
        }
        ESP_LOGW(TAG, "Unhandled ZCL action callback 0x%04lx", callback_id);
        break;
    }
}

static esp_err_t create_endpoints(void)
{
    ezb_af_device_desc_t dev_desc = ezb_af_create_device_desc();
    ezb_zha_mains_power_outlet_config_t outlet_cfg = EZB_ZHA_MAINS_POWER_OUTLET_CONFIG();
    ezb_zha_dimmable_light_config_t display_cfg = EZB_ZHA_DIMMABLE_LIGHT_CONFIG();
    ezb_zha_dimmable_light_config_t led_cfg = EZB_ZHA_DIMMABLE_LIGHT_CONFIG();
    ezb_af_ep_desc_t outlet_ep = NULL;
    ezb_af_ep_desc_t display_ep = NULL;
    ezb_af_ep_desc_t led_ep = NULL;
    ezb_zcl_cluster_desc_t onoff_desc = {0};
    ezb_zcl_attr_desc_t onoff_attr = NULL;
    uint8_t display_on = s_display_light_on ? 1 : 0;
    uint8_t led_on = s_status_led_light_on ? 1 : 0;

    ESP_RETURN_ON_FALSE(dev_desc, ESP_ERR_NO_MEM, TAG, "failed to create device descriptor");

    if (s_config.onoff_endpoint_id) {
        outlet_ep = ezb_zha_create_mains_power_outlet(s_config.onoff_endpoint_id, &outlet_cfg);
        ESP_RETURN_ON_FALSE(outlet_ep, ESP_ERR_NO_MEM, TAG, "failed to create outlet endpoint descriptor");
        ESP_RETURN_ON_ERROR(populate_basic_attrs(outlet_ep), TAG, "outlet Basic attrs failed");

        onoff_desc = ezb_af_endpoint_get_cluster_desc(outlet_ep, EZB_ZCL_CLUSTER_ID_ON_OFF, EZB_ZCL_CLUSTER_SERVER);
        ESP_RETURN_ON_FALSE(onoff_desc, ESP_ERR_NOT_FOUND, TAG, "OnOff cluster missing");

        onoff_attr = ezb_zcl_cluster_get_attr_desc(onoff_desc, EZB_ZCL_ATTR_ON_OFF_ON_OFF_ID, EZB_ZCL_STD_MANUF_CODE);
        if (onoff_attr) {
            ezb_zcl_attr_access_t access = ezb_zcl_attr_desc_get_access(onoff_attr);
            esp_err_t access_err = esp_zigbee_err_to_esp(ezb_zcl_attr_desc_set_access(onoff_attr,
                                                                                      access | EZB_ZCL_ATTR_ACCESS_REPORTING));
            if (access_err != ESP_OK) {
                ESP_LOGW(TAG, "OnOff reporting access flag not changed: %s", esp_err_to_name(access_err));
            }
            ESP_ERROR_CHECK(esp_zigbee_err_to_esp(ezb_zcl_attr_desc_set_value(onoff_attr, &s_output_on)));
        }
        ESP_ERROR_CHECK(ezb_af_device_add_endpoint_desc(dev_desc, outlet_ep));
    }

    if (s_config.display_light_endpoint_id) {
        display_cfg.on_off_cfg.on_off = display_on;
        display_cfg.level_cfg.current_level = s_display_light_level;
        display_ep = ezb_zha_create_dimmable_light(s_config.display_light_endpoint_id, &display_cfg);
        ESP_RETURN_ON_FALSE(display_ep, ESP_ERR_NO_MEM, TAG, "failed to create display light endpoint descriptor");
        ESP_RETURN_ON_ERROR(populate_basic_attrs(display_ep), TAG, "display Basic attrs failed");
        ESP_RETURN_ON_ERROR(set_cluster_attr(display_ep, EZB_ZCL_CLUSTER_ID_ON_OFF,
                                             EZB_ZCL_ATTR_ON_OFF_ON_OFF_ID, &display_on),
                            TAG, "display OnOff attr failed");
        ESP_RETURN_ON_ERROR(set_cluster_attr(display_ep, EZB_ZCL_CLUSTER_ID_LEVEL,
                                             EZB_ZCL_ATTR_LEVEL_CURRENT_LEVEL_ID, &s_display_light_level),
                            TAG, "display level attr failed");
        ESP_ERROR_CHECK(ezb_af_device_add_endpoint_desc(dev_desc, display_ep));
    }

    if (s_config.status_led_endpoint_id) {
        led_cfg.on_off_cfg.on_off = led_on;
        led_cfg.level_cfg.current_level = s_status_led_light_level;
        led_ep = ezb_zha_create_dimmable_light(s_config.status_led_endpoint_id, &led_cfg);
        ESP_RETURN_ON_FALSE(led_ep, ESP_ERR_NO_MEM, TAG, "failed to create status LED endpoint descriptor");
        ESP_RETURN_ON_ERROR(populate_basic_attrs(led_ep), TAG, "LED Basic attrs failed");
        ESP_RETURN_ON_ERROR(set_cluster_attr(led_ep, EZB_ZCL_CLUSTER_ID_ON_OFF,
                                             EZB_ZCL_ATTR_ON_OFF_ON_OFF_ID, &led_on),
                            TAG, "LED OnOff attr failed");
        ESP_RETURN_ON_ERROR(set_cluster_attr(led_ep, EZB_ZCL_CLUSTER_ID_LEVEL,
                                             EZB_ZCL_ATTR_LEVEL_CURRENT_LEVEL_ID, &s_status_led_light_level),
                            TAG, "LED level attr failed");
        ESP_ERROR_CHECK(ezb_af_device_add_endpoint_desc(dev_desc, led_ep));
    }

    if (s_config.extra_endpoints_cb) {
        ESP_RETURN_ON_ERROR(s_config.extra_endpoints_cb(dev_desc, s_config.callback_ctx), TAG, "extra endpoint registration failed");
    }

    ESP_ERROR_CHECK(ezb_af_device_desc_register(dev_desc));
    ezb_zcl_core_action_handler_register(zcl_action_handler);

    return ESP_OK;
}

static esp_err_t setup_commissioning(void)
{
    ezb_aps_secur_enable_distributed_security(false);
    ESP_ERROR_CHECK(ezb_bdb_set_primary_channel_set(s_config.primary_channel_mask));
    ESP_ERROR_CHECK(ezb_bdb_set_secondary_channel_set(s_config.secondary_channel_mask));
    ESP_ERROR_CHECK(ezb_app_signal_add_handler(zigbee_signal_handler));

    return ESP_OK;
}

