wilhel1812/esp32-c6-zigbee-base/components/esp32_c6_zigbee_base/esp32_c6_zigbee_base.c
static void zigbee_main_task(void *pvParameters)
{
    esp_zigbee_config_t config = {
        .device_config = {
            .device_type = EZB_NWK_DEVICE_TYPE_ROUTER,
            .install_code_policy = false,
            .zczr_config = {
                .max_children = 10,
            },
        },
        .platform_config = {
            .storage_partition_name = s_config.storage_partition_name,
#if CONFIG_SOC_IEEE802154_SUPPORTED
            .radio_config = {
                .radio_mode = ESP_ZIGBEE_RADIO_MODE_NATIVE,
            },
#endif
        },
    };

    ESP_ERROR_CHECK(esp_zigbee_init(&config));
    ESP_ERROR_CHECK(setup_commissioning());
    ESP_ERROR_CHECK(create_endpoints());
    ESP_ERROR_CHECK(esp_zigbee_start(false));

    esp_zigbee_launch_mainloop();
    esp_zigbee_deinit();
    vTaskDelete(NULL);
}

esp_err_t esp32_c6_zigbee_base_start(const esp32_c6_zigbee_base_config_t *config)
{
    copy_config(config);

    esp_err_t ret = nvs_flash_init();
    if (ret == ESP_ERR_NVS_NO_FREE_PAGES || ret == ESP_ERR_NVS_NEW_VERSION_FOUND) {
        ESP_RETURN_ON_ERROR(nvs_flash_erase(), TAG, "failed to erase default NVS");
        ret = nvs_flash_init();
    }
    ESP_RETURN_ON_ERROR(ret, TAG, "failed to initialize default NVS");
    ESP_RETURN_ON_ERROR(nvs_flash_init_partition(s_config.storage_partition_name), TAG, "failed to initialize Zigbee NVS partition");

    ESP_RETURN_ON_ERROR(status_led_init(), TAG, "failed to initialize status LED");
    ESP_RETURN_ON_ERROR(status_display_init(), TAG, "failed to initialize status display");
    status_display_set_state(STATUS_DISPLAY_BOOTING);
    status_led_startup_pulse();
    update_visual_state(STATUS_LED_MODE_JOINING, STATUS_DISPLAY_PAIRING);
    ESP_RETURN_ON_ERROR(load_app_state(), TAG, "failed to load app state");
    apply_user_lights();
    ESP_RETURN_ON_ERROR(board_input_init(&(board_input_config_t){
                            .boot_gpio = s_config.boot_gpio,
                            .external_reset_gpio = s_config.external_reset_gpio,
                            .factory_reset_hold_ms = s_config.factory_reset_hold_ms,
                            .callback = board_input_handler,
                        }),
                        TAG, "failed to initialize board input");

    ESP_LOGI(TAG, "Start ESP32-C6 Zigbee base");
    xTaskCreate(zigbee_main_task, "Zigbee_main", 4096, NULL, 5, NULL);
    return ESP_OK;
}

bool esp32_c6_zigbee_base_is_joined(void)
{
    return s_joined;
}
